class Normalizer:
    def __init__(self):
        self.common_arabic_alphabet = {'ﻱ': 'ی', 'ي': 'ی', 'ﻲ': 'ی', 'ﻙ': 'ک', 'ﻛ': 'ک', 'ﻜ': 'ک', 'ﻚ': 'ک', 'ﻋ': '',
                                       'أ': 'ا', 'إ': 'ا', 'ئ': 'ی', 'ٔ': '', 'ؤ': 'و'}

        self.english_numbers = {'0': '۰', '1': '۱', '2': '۲', '3': '۳', '4': '۴', '5': '۵', '6': '۶', '7': '۷',
                                '8': '۸', '9': '۹'}

        self.characters = {'%': '٪', '-': ' ', u'\u200c': ' '}

        self.advanced_chars = {
            'ﺁ': 'آ', 'ﺂ': 'آ', 'ﺍ': 'ا', 'ﺎ': 'ا', 'ٲ': 'ا', 'ٵ': 'ا', 'ﭐ': 'ا', 'ﭑ': 'ا', 'ﺃ': 'ا', 'ﺄ': 'ا',
            'ٳ': 'ا', 'ﺇ': 'ا', 'ﺈ': 'ا', 'إ': 'ا', 'أ': 'ا', 'ꙇ': 'ا', 'ٮ': 'ب', 'ٻ': 'ب', 'ڀ': 'ب', 'ݐ': 'ب',
            'ݒ': 'ب', 'ݔ': 'ب', 'ݕ': 'ب', 'ݖ': 'ب', 'ﭒ': 'ب', 'ﭓ': 'ب', 'ﭔ': 'ب', 'ﭕ': 'ب', 'ﺏ': 'ب', 'ﺐ': 'ب',
            'ﺑ': 'ب', 'ﺒ': 'ب', 'ﭖ': 'پ', 'ﭗ': 'پ', 'ﭘ': 'پ', 'ﭙ': 'پ', 'ﭚ': 'پ', 'ﭛ': 'پ', 'ﭜ': 'پ', 'ﭝ': 'پ',
            'ٹ': 'ت', 'ٺ': 'ت', 'ټ': 'ت', 'ٿ': 'ت', 'ݓ': 'ت', 'ﭞ': 'ت', 'ﭟ': 'ت', 'ﭠ': 'ت', 'ﭡ': 'ت', 'ﭦ': 'ت',
            'ﭧ': 'ت', 'ﭨ': 'ت', 'ﭩ': 'ت', 'ﺕ': 'ت', 'ﺖ': 'ت', 'ﺗ': 'ت', 'ﺘ': 'ت', 'ٽ': 'ث', 'ݑ': 'ث', 'ﺙ': 'ث',
            'ﺚ': 'ث', 'ﺛ': 'ث', 'ﺜ': 'ث', 'ﭢ': 'ث', 'ﭣ': 'ث', 'ﭤ': 'ث', 'ﭥ': 'ث', 'ڃ': 'ج', 'ڄ': 'ج', 'ﭲ': 'ج',
            'ﭳ': 'ج', 'ﭴ': 'ج', 'ﭵ': 'ج', 'ﭶ': 'ج', 'ﭷ': 'ج', 'ﭸ': 'ج', 'ﭹ': 'ج', 'ﺝ': 'ج', 'ﺞ': 'ج', 'ﺟ': 'ج',
            'ﺠ': 'ج', 'ڇ': 'چ', 'ڿ': 'چ', 'ﭺ': 'چ', 'ﭻ': 'چ', 'ݘ': 'چ', 'ﭼ': 'چ', 'ﭽ': 'چ', 'ﭾ': 'چ', 'ﭿ': 'چ',
            'ﮀ': 'چ', 'ﮁ': 'چ', 'ݯ': 'چ', 'ځ': 'ح', 'ڂ': 'ح', 'څ': 'ح', 'ݗ': 'ح', 'ݮ': 'ح', 'ﺡ': 'ح', 'ﺢ': 'ح',
            'ﺣ': 'ح', 'ﺤ': 'ح', 'ﺥ': 'خ', 'ﺦ': 'خ', 'ﺧ': 'خ', 'ﺨ': 'خ', 'ڈ': 'د', 'ډ': 'د', 'ڊ': 'د', 'ڋ': 'د',
            'ڍ': 'د', 'ۮ': 'د', 'ݙ': 'د', 'ݚ': 'د', 'ﮂ': 'د', 'ﮃ': 'د', 'ﮄ': 'د', 'ﮈ': 'د', 'ﮉ': 'د', 'ﺩ': 'د',
            'ﺪ': 'د', 'ڌ': 'ذ', 'ﺫ': 'ذ', 'ﺬ': 'ذ', 'ڎ': 'ذ', 'ڏ': 'ذ', 'ڐ': 'ذ', 'ﮅ': 'ذ', 'ﮆ': 'ذ', 'ﮇ': 'ذ',
            'ڑ': 'ر', 'ڒ': 'ر', 'ړ': 'ر', 'ڔ': 'ر', 'ڕ': 'ر', 'ږ': 'ر', 'ۯ': 'ر', 'ݛ': 'ر', 'ﮌ': 'ر', 'ﮍ': 'ر',
            'ﺭ': 'ر', 'ﺮ': 'ر', 'ڗ': 'ز', 'ݫ': 'ز', 'ݬ': 'ز', 'ﺯ': 'ز', 'ﺰ': 'ز', 'ڙ': 'ژ', 'ﮊ': 'ژ', 'ﮋ': 'ژ',
            'ښ': 'س', 'ڛ': 'س', 'ﺱ': 'س', 'ﺲ': 'س', 'ﺳ': 'س', 'ﺴ': 'س', 'ڜ': 'ش', 'ۺ': 'ش', 'ﺵ': 'ش', 'ﺶ': 'ش',
            'ﺷ': 'ش', 'ﺸ': 'ش', 'ݜ': 'ش', 'ݭ': 'ش', 'ڝ': 'ص', 'ڞ': 'ص', 'ﺹ': 'ص', 'ﺺ': 'ص', 'ﺻ': 'ص', 'ﺼ': 'ص',
            'ۻ': 'ض', 'ﺽ': 'ض', 'ﺾ': 'ض', 'ﺿ': 'ض', 'ﻀ': 'ض', 'ﻁ': 'ط', 'ﻂ': 'ط', 'ﻃ': 'ط', 'ﻄ': 'ط', 'ﻅ': 'ظ',
            'ﻆ': 'ظ', 'ﻇ': 'ظ', 'ﻈ': 'ظ', 'ڟ': 'ظ', 'ڠ': 'ع', 'ݝ': 'ع', 'ݞ': 'ع', 'ݟ': 'ع', 'ﻉ': 'ع', 'ﻊ': 'ع',
            'ﻋ': 'ع', 'ﻌ': 'ع', 'ۼ': 'غ', 'ﻍ': 'غ', 'ﻎ': 'غ', 'ﻏ': 'غ', 'ﻐ': 'غ', 'ڡ': 'ف', 'ڢ': 'ف', 'ڣ': 'ف',
            'ڤ': 'ف', 'ڥ': 'ف', 'ڦ': 'ف', 'ݠ': 'ف', 'ݡ': 'ف', 'ﭪ': 'ف', 'ﭫ': 'ف', 'ﭬ': 'ف', 'ﭭ': 'ف', 'ﭮ': 'ف',
            'ﭯ': 'ف', 'ﭰ': 'ف', 'ﭱ': 'ف', 'ﻑ': 'ف', 'ﻒ': 'ف', 'ﻓ': 'ف', 'ﻔ': 'ف', 'ᓅ': 'ف', 'ٯ': 'ق', 'ڧ': 'ق',
            'ڨ': 'ق', 'ﻕ': 'ق', 'ﻖ': 'ق', 'ﻗ': 'ق', 'ﻘ': 'ق', 'ك': 'ک', 'ػ': 'ک', 'ؼ': 'ک', 'ڪ': 'ک', 'ګ': 'ک',
            'ڬ': 'ک', 'ڭ': 'ک', 'ڮ': 'ک', 'ݢ': 'ک', 'ݣ': 'ک', 'ݤ': 'ک', 'ﮎ': 'ک', 'ﮏ': 'ک', 'ﮐ': 'ک', 'ﮑ': 'ک',
            'ﯓ': 'ک', 'ﯔ': 'ک', 'ﯕ': 'ک', 'ﯖ': 'ک', 'ﻙ': 'ک', 'ﻚ': 'ک', 'ﻛ': 'ک', 'ﻜ': 'ک', 'ڰ': 'گ', 'ڱ': 'گ',
            'ڲ': 'گ', 'ڳ': 'گ', 'ڴ': 'گ', 'ﮒ': 'گ', 'ﮓ': 'گ', 'ﮔ': 'گ', 'ﮕ': 'گ', 'ﮖ': 'گ', 'ﮗ': 'گ', 'ﮘ': 'گ',
            'ﮙ': 'گ', 'ﮚ': 'گ', 'ﮛ': 'گ', 'ﮜ': 'گ', 'ﮝ': 'گ', 'ڵ': 'ل', 'ڶ': 'ل', 'ڷ': 'ل', 'ڸ': 'ل', 'ݪ': 'ل',
            'ﻝ': 'ل', 'ﻞ': 'ل', 'ﻟ': 'ل', 'ﻠ': 'ل', '۾': 'م', 'ݥ': 'م', 'ݦ': 'م', 'ﻡ': 'م', 'ﻢ': 'م', 'ﻣ': 'م',
            'ﻤ': 'م', 'ڹ': 'ن', 'ں': 'ن', 'ڻ': 'ن', 'ڼ': 'ن', 'ڽ': 'ن', 'ݧ': 'ن', 'ݨ': 'ن', 'ݩ': 'ن', 'ﮞ': 'ن',
            'ﮟ': 'ن', 'ﮠ': 'ن', 'ﮡ': 'ن', 'ﮢ': 'ن', 'ﮣ': 'ن', 'ﻥ': 'ن', 'ﻦ': 'ن', 'ﻧ': 'ن', 'ﻨ': 'ن', 'ٶ': 'و',
            'ٷ': 'و', 'ﯗ': 'و', 'ﯘ': 'و', 'ﯙ': 'و', 'ﯚ': 'و', 'ﯛ': 'و', 'ﯜ': 'و', 'ﯝ': 'و', 'ﯞ': 'و', 'ﯟ': 'و',
            'ﺅ': 'و', 'ﺆ': 'و', 'ۄ': 'و', 'ۅ': 'و', 'ۆ': 'و', 'ۇ': 'و', 'ۈ': 'و', 'ۉ': 'و', 'ۊ': 'و', 'ۋ': 'و',
            'ۏ': 'و', 'ﯠ': 'و', 'ﯡ': 'و', 'ﯢ': 'و', 'ﯣ': 'و', 'ﻭ': 'و', 'ﻮ': 'و', 'ؤ': 'و', 'פ': 'و', 'ھ': 'ه',
            'ۿ': 'ه', 'ۀ': 'ه', 'ہ': 'ه', 'ۂ': 'ه', 'ۃ': 'ه', 'ە': 'ه', 'ﮤ': 'ه', 'ﮥ': 'ه', 'ﮦ': 'ه', 'ﮧ': 'ه',
            'ﮨ': 'ه', 'ﮩ': 'ه', 'ﮪ': 'ه', 'ﮫ': 'ه', 'ﮬ': 'ه', 'ﮭ': 'ه', 'ﺓ': 'ه', 'ﺔ': 'ه', 'ﻩ': 'ه', 'ﻪ': 'ه',
            'ﻫ': 'ه', 'ﻬ': 'ه', 'ة': 'ه', 'ؠ': 'ی', 'ؽ': 'ی', 'ؾ': 'ی', 'ؿ': 'ی', 'ى': 'ی', 'ي': 'ی', 'ٸ': 'ی',
            'ۍ': 'ی', 'ێ': 'ی', 'ې': 'ی', 'ۑ': 'ی', 'ے': 'ی', 'ۓ': 'ی', 'ﮮ': 'ی', 'ﮯ': 'ی', 'ﮰ': 'ی', 'ﮱ': 'ی',
            'ﯤ': 'ی', 'ﯥ': 'ی', 'ﯦ': 'ی', 'ﯧ': 'ی', 'ﯼ': 'ی', 'ﯽ': 'ی', 'ﯾ': 'ی', 'ﯿ': 'ی', 'ﻯ': 'ی', 'ﻰ': 'ی',
            'ﻱ': 'ی', 'ﻲ': 'ی', 'ﻳ': 'ی', 'ﻴ': 'ی', 'ﯨ': 'ی', 'ﯩ': 'ی', 'ۦ': 'ی', 'ﺉ': 'ی', 'ﺊ': 'ی', 'ﺋ': 'ی',
            'ﺌ': 'ی', 'ئ': 'ی', '٠': '۰', '𝟢': '۰', '𝟬': '۰', '١': '۱', '𝟣': '۱', '𝟭': '۱', '⑴': '۱', '⒈': '۱',
            '⓵': '۱', '①': '۱', '❶': '۱', '𝟙': '۱', '𝟷': '۱', 'ı': '۱', '٢': '۲', '𝟤': '۲', '𝟮': '۲', '⑵': '۲',
            '⒉': '۲', '⓶': '۲', '②': '۲', '❷': '۲', '²': '۲', '𝟐': '۲', '𝟸': '۲', '𝟚': '۲', 'ᒿ': '۲', 'շ': '۲',
            '٣': '۳', '𝟥': '۳', '𝟯': '۳', '⑶': '۳', '⒊': '۳', '⓷': '۳', '③': '۳', '❸': '۳', '³': '۳', 'ვ': '۳',
            '٤': '۴', '𝟦': '۴', '𝟰': '۴', '⑷': '۴', '⒋': '۴', '⓸': '۴', '④': '۴', '❹': '۴', '⁴': '۴', '٥': '۵',
            '𝟧': '۵', '𝟱': '۵', '⑸': '۵', '⒌': '۵', '⓹': '۵', '⑤': '۵', '❺': '۵', '⁵': '۵', '٦': '۶', '𝟨': '۶',
            '𝟲': '۶', '⑹': '۶', '⒍': '۶', '⓺': '۶', '⑥': '۶', '❻': '۶', '⁶': '۶', '٧': '۷', '𝟩': '۷', '𝟳': '۷',
            '⑺': '۷', '⒎': '۷', '⓻': '۷', '⑦': '۷', '❼': '۷', '⁷': '۷', '٨': '۸', '𝟪': '۸', '𝟴': '۸', '⑻': '۸',
            '⒏': '۸', '⓼': '۸', '⑧': '۸', '❽': '۸', '⁸': '۸', '٩': '۹', '𝟫': '۹', '𝟵': '۹', '⑼': '۹', '⒐': '۹',
            '⓽': '۹', '⑨': '۹', '❾': '۹', '⁹': '۹',

        }

    def normalize(self, text):
        text = list(text.lower())
        for index in range(0, len(text)):
            if self.common_arabic_alphabet.get(text[index]) is not None:
                text[index] = self.common_arabic_alphabet.get(text[index])
            elif self.english_numbers.get(text[index]) is not None:
                text[index] = self.english_numbers.get(text[index])
            elif self.characters.get(text[index]) is not None:
                text[index] = self.characters.get(text[index])
        return ''.join(text)

    def advanced_normalize(self, text):
        text = list(text.lower())
        for index in range(0, len(text)):
            if self.common_arabic_alphabet.get(text[index]) is not None:
                text[index] = self.common_arabic_alphabet.get(text[index])
            elif self.advanced_chars.get(text[index]) is not None:
                text[index] = self.advanced_chars.get(text[index])
            elif self.english_numbers.get(text[index]) is not None:
                text[index] = self.english_numbers.get(text[index])
            elif self.characters.get(text[index]) is not None:
                text[index] = self.characters.get(text[index])
        return ''.join(text)
